{
    "sections": [
        {
            "title": "Team PANIC",
            "text": "Our team name, PANIC, stands for Pathfinding Automobile Network of Induction Charging.",
            "type": "text",
            "subsection": "team name"
        },
        {
            "title": "Cars",
            "text": "The car is built in a custom designed 3d printed shell. It drives using two motors controlled from a Raspberry Pi HAT, and uses a TP4056 charge controller to take power input from a Qi coil, charging a Lithium Ion battery.",
            "type": "text",
            "subsection": "engineering"
        },
        {
            "title": "Road",
            "text": "The road can be created anywhere, with just a few strips of colored tape and some printed Aruco tags",
            "type": "text",
            "subsection": "engineering"
        },
        {
            "title": "System Diagram",
            "type": "disabled",
            "src": "https://cdn.discordapp.com/attachments/1043510032618238082/1087365305870852136/hg5i5la6Q4.png",
            "subsection": "System Overview"
        },
        {
            "title": "Hosting",
            "type": "text",
            "text": "This website is currently hosted for free using cloudflare pages. The domain was free from nic.eu.org.",
            "subsection": "website"
        },
        {
            "title": "How its built",
            "type": "text",
            "text": "The website is built using React.js and MUI, a library which provides prebuilt React component to make the website look nice.",
            "subsection": "website"
        },
        {
            "title": "Purpose",
            "type": "text",
            "text": "The website is used for controlling the car and the server such as directing the cars to a specific location, rebooting the cars and starting or stopping the cars driving. The website also displays current statistics of the controller such as TPS and temperature.",
            "subsection": "website"
        },
        {
            "title": "API",
            "type": "text",
            "text": "The application programming interface is a complex and efficient comminication method for facilitating the comminication between the website, the control server and the car. It allows them to use the RESTful specification for expected and standardised communication. The HTTP server is written using Flask, a python library for creating web servers",
            "subsection": "backend"
        },
        {
            "title": "Map Detection",
            "type": "text",
            "text": "abbas write your stuff here",
            "subsection": "algorithms"
        },
        {
            "title": "Pathfinding",
            "type": "text",
            "text": "abbas write your stuff here",
            "subsection": "algorithms"
        },
        {
            "title": "whatever else",
            "type": "text",
            "text": "abbas write your stuff here",
            "subsection": "algorithms"
        }
    ]
}